Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.InputTypes.INPUT_ONE_OBJECT
The input has one drawing object. The supported drawing objects are bolts, parts, rebars and views.
Bolts, parts and rebars are drawing objects derived from model objects. The parts include the beam, the
contour plate and the polybeam.